tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "jzaleski/jzaleski"
tap "trashhalo/brews"
brew "aspell"
brew "ast-grep"
brew "autoconf"
brew "bat"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "d12frosted/emacs-plus/emacs-plus", args: ["with-dragon-icon", "with-imagemagick", "with-xwidgets"]
brew "difftastic"
brew "duckdb"
brew "fd"
brew "freetds"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gitu"
brew "gnupg"
brew "graphviz"
brew "helix"
brew "htop"
brew "ispell"
brew "jzaleski/jzaleski/apg"
brew "lazygit"
brew "libgccjit"
brew "libvterm"
brew "luarocks"
brew "mise"
brew "neovim"
brew "pandoc"
brew "pinentry-mac"
brew "pkg-config"
brew "plantuml"
brew "pngpaste"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "tmux"
brew "trashhalo/brews/imgcat"
brew "tree"
brew "tree-sitter-cli"
brew "unixodbc"
brew "uv"
brew "vim"
brew "wget"
brew "xmlstarlet"
brew "yt-dlp"
cask "alacritty"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-ibm-plex-mono"
cask "font-iosevka-nerd-font"
cask "font-iosevka-aile"
cask "font-meslo-for-powerlevel10k"
cask "font-meslo-lg-nerd-font"
cask "font-source-code-pro"
cask "font-zed-mono"
cask "font-zed-mono-nerd-font"
cask "ghostty"
cask "icanhazshortcut"
cask "neovide-app"
cask "spotify"
cask "stats"
cask "zed"
