tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "jzaleski/jzaleski"
tap "trashhalo/brews"
brew "aspell"
brew "autoconf"
brew "bat"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "d12frosted/emacs-plus/emacs-plus", args: ["with-dragon-icon", "with-imagemagick"]
brew "difftastic"
brew "fd"
brew "freetds"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "graphviz"
brew "htop"
brew "ispell"
brew "jzaleski/jzaleski/apg"
brew "lazygit"
brew "libgccjit"
brew "mise"
brew "neovim"
brew "pinentry-mac"
brew "pkg-config"
brew "plantuml"
brew "pngpaste"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "stats"
brew "tmux"
brew "trashhalo/brews/imgcat"
brew "tree"
brew "unixodbc"
brew "uv"
brew "vim"
brew "wget"
brew "yt-dlp"
brew "zed"
cask "alacritty"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-source-code-pro"
cask "icanhazshortcut"
cask "neovide"
cask "spotify"
