tap "d12frosted/emacs-plus"
tap "FelixKratz/formulae"
tap "jzaleski/jzaleski"
tap "nikitabobko/tap"
tap "steipete/tap"
tap "trashhalo/brews"
brew "aspell"
brew "ast-grep"
brew "autoconf"
brew "bat"
brew "borders"
brew "btop"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "d12frosted/emacs-plus/emacs-plus", args: ["with-imagemagick", "with-xwidgets"]
brew "difftastic"
brew "duckdb"
brew "dyff"
brew "fd"
brew "ffmpeg"
brew "freetds"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gitu"
brew "gnupg"
brew "go"
brew "graphviz"
brew "helix"
brew "htop"
brew "imagemagick"
brew "ispell"
brew "jzaleski/jzaleski/apg"
brew "just"
brew "k3d"
brew "lazygit"
brew "libgccjit"
brew "libvterm"
brew "luarocks"
brew "mise"
brew "neovim"
brew "pandoc"
brew "pinentry-mac"
brew "pkg-config"
brew "plantuml"
brew "pngpaste"
brew "prek"
brew "rainfrog"
brew "reattach-to-user-namespace"
brew "resvg"
brew "rename"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "trashhalo/brews/imgcat"
brew "tree"
brew "tree-sitter-cli"
brew "unixodbc"
brew "uv"
brew "vim"
brew "watch"
brew "wget"
brew "xmlstarlet"
brew "yazi"
brew "yt-dlp"
cask "aerospace"
cask "alacritty"
cask "steipete/tap/codexbar"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-ibm-plex-mono"
cask "font-iosevka-nerd-font"
cask "font-iosevka-aile"
cask "font-meslo-for-powerlevel10k"
cask "font-meslo-lg-nerd-font"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
cask "font-zed-mono"
cask "font-zed-mono-nerd-font"
cask "ghostty"
cask "icanhazshortcut"
cask "karabiner-elements"
cask "mouseless"
cask "neovide-app"
cask "rancher"
cask "spotify"
cask "stats"
cask "syncthing-app"
cask "zed"
